#Если Сервер Тогда
#Область ПрограммныйИнтерфейс   

// Добавляет на форму текущего документа необходимые поля
// во время работы обработчика ПриСозданииНаСервере
//
// Параметры:
//   Форма - Форма - Текущая форма (для Документа)
//
Процедура ДополнитьФорму(Форма) Экспорт 
	
	ДополнитьФормуДокументов(Форма);    
	ДополнитьФормуСписков(Форма);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьФормуДокументов(Форма)
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
//		ДобавитьПолеСтатусЗаказаНаФормуГруппаШапкаЛево(Форма);
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
//		ДобавитьГруппуСогласованнаяСкидкаВГруппаШапкаЛево(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;       
	
КонецПроцедуры

Процедура ДополнитьФормуСписков(Форма)
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаСписка" Тогда              
//		ВставитьПолеСтатусЗаказаВДинамическийСписокПередОрганизация(Форма);
		ВставитьПолеКонтактноеЛицоВДинамическийСписокПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаСписка" Тогда 
		ВставитьПолеКонтактноеЛицоВДинамическийСписокПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаСписка" Тогда 
		ВставитьПолеКонтактноеЛицоВДинамическийСписокПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаСписка" Тогда 
		ВставитьПолеКонтактноеЛицоВДинамическийСписокПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаСписка" Тогда 
		ВставитьПолеКонтактноеЛицоВДинамическийСписокПередСуммаДокумента(Форма);
	КонецЕсли;           
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)  
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьГруппуСогласованнаяСкидкаВГруппаШапкаЛево(Форма)  
	      
	ГруппаСогласованнаяСкидка = Форма.Элементы.Добавить("ДП_ГруппаСогласованнаяСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево); 
	ГруппаСогласованнаяСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаСогласованнаяСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСогласованнаяСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСогласованнаяСкидка.Заголовок = "Группа согласованная скидка";
	
	ПолеВвода = Форма.Элементы.Добавить("ДП_СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСогласованнаяСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_СогласованнаяСкидка";        
	ПолеВвода.УстановитьДействие("ПриИзменении", "ДП_СогласованнаяСкидкаПриИзменении");	
	
	Команда = Форма.Команды.Добавить("ДП_ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать таблицу";  
	Команда.Картинка = БиблиотекаКартинок.Обновить;         
	Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Команда.Действие = "ДП_ПересчитатьТаблицу";

	КнопкаФормы = Форма.Элементы.Добавить("ДП_ПересчитатьТаблицу", Тип("КнопкаФормы"), ГруппаСогласованнаяСкидка);
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.ИмяКоманды = "ДП_ПересчитатьТаблицу";  

КонецПроцедуры

Процедура ДобавитьПолеСтатусЗаказаНаФормуГруппаШапкаЛево(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("СтатусЗаказа", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;  
//	ПолеВвода.ТолькоПросмотр = Истина;                    
	ПолеВвода.АвтоМаксимальнаяШирина = Ложь;
	ПолеВвода.РастягиватьПоГоризонтали = Истина;
	ПолеВвода.ПутьКДанным = "Объект.ДП_СтатусЗаказа";
	
КонецПроцедуры

Процедура ВставитьПолеСтатусЗаказаВДинамическийСписокПередОрганизация(Форма)  
	
	ПолеВвода = Форма.Элементы.Вставить("СтатусЗаказа", Тип("ПолеФормы"), Форма.Элементы.Список, Форма.Элементы.Организация);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Список.Ссылка.ДП_СтатусЗаказа";
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоВДинамическийСписокПередСуммаДокумента(Форма)  
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.Список, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Список.Ссылка.ДП_КонтактноеЛицо";
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
